app/views/home/idea.html.erb

SELECT COUNT(*) FROM `ideas`
SELECT `ideas`.* FROM `ideas` ORDER BY ideas.idea ASC
---

  <div><%= pluralize(@idea.size, 'idea') %> found</div>