app/controllers/home_controller.rb

	def idea
		@idea = Idea.order("ideas.idea ASC")
---
SELECT `ideas`.* FROM `ideas` ORDER BY ideas.idea ASC

	def show
		@idea = Idea.find(params[:id])
---
SELECT `ideas`.* FROM `ideas` WHERE `ideas`.`id` = 1 LIMIT 1

	def create
		@idea = Idea.new(params[:ideaCreation])
		if @idea.save
---
INSERT INTO `ideas` (`created_at`, `description`, `idea`, `idea_id`, `permalink`, `tags`, `ticket`, `title`, `updated_at`, `upvote`, `visible`) VALUES ('2013-02-27 01:06:47', 'yo you', NULL, NULL, NULL, NULL, NULL, 'A short pitch for the idea', '2013-02-27 01:06:47', NULL, 0)

	def edit
		@idea = Idea.find(params[:id])
---
SELECT `ideas`.* FROM `ideas` WHERE `ideas`.`id` = 1 LIMIT 1

	def update
		@idea = Idea.find(params[:id])
		if @idea.update_attributes(params[:idea])
---
SELECT `ideas`.* FROM `ideas` WHERE `ideas`.`id` = 2253948 LIMIT 1
UPDATE `ideas` SET `description` = 'This is the idea', `updated_at` = '2013-02-27 01:30:56' WHERE `ideas`.`id` = 1

	def delete
	   Idea.find(params[:id]).destroy
---
DELETE FROM `ideas` WHERE `ideas`.`id` = 3
SELECT `ideas`.* FROM `ideas` WHERE `ideas`.`id` = 3 LIMIT 1